sobczyk/bsp/csps/lpc32xx/source/lpc32xx_i2s_driver.c
  /* read the current Tx channel configuration */
  tmp = i2sregs->i2s_dao;

  /* set the word width */
  tmp = tmp | pparms->i2s_word_width ;

  /* Based on the word width, set the WS half period */
  tmp = (tmp & ~WSMASK_HP);
  if (pparms->i2s_word_width == I2S_WW32)
  {
    tmp = tmp | I2S_WS_HP(I2S_WW32_HP);
  }
  else if (pparms->i2s_word_width == I2S_WW16)
  {
    tmp = tmp | I2S_WS_HP(I2S_WW16_HP);
  }
  else
  {
    tmp = tmp | I2S_WS_HP(I2S_WW8_HP);
  }

  /* mono or stereo channel */
  if (pparms->i2s_mono == TRUE)
  {
    tmp = tmp | I2S_MONO;
  }
  else
  {
    tmp = tmp & ~I2S_MONO;
  }

  /* stop */
  if (pparms->i2s_stop == TRUE)
  {
    tmp = tmp | I2S_STOP;
  }
  else
  {
    tmp = tmp & ~I2S_STOP;
  }

  /* Set Rx channel in Master(0) or Slave(1) mode */
  if (pparms->i2s_rx_slave == FALSE)
  {
    tmp = tmp & ~I2S_WS_SEL; // master mode
  }
  else
  {
    tmp = tmp  | I2S_WS_SEL; // slave mode
  }

  /* write the rx channel value */
  i2sregs->i2s_dai = tmp;

  /* Set Tx channel in Master or Slave mode */
  if (pparms->i2s_tx_slave == FALSE)
  {
    tmp = tmp & ~I2S_WS_SEL; // master mode
  }
  else
  {
    tmp = tmp | I2S_WS_SEL; // slave mode
  }

  /* write the tx channel value */
  if (pparms->i2s_mute == TRUE)
  {
    i2sregs->i2s_dao = tmp | I2S_MUTE ;
  }
  else
  {
    tmp = tmp & ~I2S_MUTE;
    i2sregs->i2s_dao = tmp ;
  }

  /* set the tx/rx rate */
  i2sregs->i2s_tx_rate = i2sregs->i2s_rx_rate = pparms->i2s_rate;

  /* set the DMA1 Config register */
  i2sregs->i2s_dma0 = pparms->i2s_dma0_con;

  /* set the DMA2 Config register */
  i2sregs->i2s_dma1 = pparms->i2s_dma1_con;


  return _NO_ERROR;
}

/***********************************************************************
 *
 * Function: i2s_default
 *
 * Purpose: Places the ISC interface and controller in a default state
 *
 * Processing:
 *			  See Function
 * Parameters:
 *     i2sregs: Pointer to an I2S register set
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
STATIC void i2s_default(I2S_REGS_T *i2sregs)
{

  /* Setup default state of I2S in DEFAULT mode, with all
     channels set up in a safe configuration, and all
     interrupts masked. 16Bit Stereo, 48KHz (assuming 104MHz HCLK)
   FIFO Interrupt depth set to 8 (not DMA) */

  /* Set transmit channel to default state, master mode, 16bit */
  i2sregs->i2s_dao = I2S_STOP | I2S_WW16 | I2S_WS_HP(I2S_WW16_HP);

  /* Set receive channel to default state, slave mode, 16bit  */
  i2sregs->i2s_dai = I2S_STOP | I2S_WW16 | I2S_WS_SEL 
                     | I2S_WS_HP(I2S_WW16_HP);

  /* reset Tx rate to default */
  i2sregs->i2s_tx_rate = A48KHZ104MHZ16BIT;

  /* reset Rx rate to default */
  i2sregs->i2s_rx_rate = A48KHZ104MHZ16BIT;

  /* clear the DMA configuration register */
  i2sregs->i2s_dma0 = i2sregs->i2s_dma1 = 0;

  /* Set the Tx/Rx FIFO Trigger levels */
  i2sregs->i2s_irq = (I2S_IRQ_TX_DEPTH(8) | I2S_IRQ_RX_DEPTH(8));

}


/***********************************************************************
 * I2S driver public functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: i2s_open
 *
 * Purpose: Open the I2S
 *
 * Processing:
 *     If init is not FALSE, return 0x00000000 to the caller. Otherwise,
 *     set init to TRUE, save the I2S peripheral register set address,
 *     and initialize the I2S interface and controller to a default
 *     state by calling i2s_default(), and return a pointer to the I2S
 *     config structure to the caller.
 *
 * Parameters:
 *     ipbase: I2S descriptor device address
 *     arg   : Not used
 *
 * Outputs: None
 *
 * Returns: The pointer to a I2S config structure or 0
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 i2s_open(void *ipbase,
                INT_32 arg)
{
  INT_32 status = 0;
  INT_32 i2snum;

  /* find a matching I2S number based on the passed pointer */
  i2snum = i2s_ptr_to_i2s_num((I2S_REGS_T *) ipbase);

  if (i2snum >= 0)
  {

    /* Has the I2S been previously initialized? */
    if (i2sdat[i2snum].init == FALSE)
    {

      /* Device is valid and not previously initialized */
      i2sdat[i2snum].init = TRUE;

      /* Device is valid and not previously initialized */
      i2sdat[i2snum].i2snum = i2snum;

      /* Default i2s word width is 16bit */
      i2sdat[i2snum].i2s_w_sz = I2S_WW16;

      /* Save and return address of peripheral block */
      i2sdat[i2snum].regptr = (I2S_REGS_T *) ipbase;

      /* Place I2S in a default state */
      i2s_default(i2sdat[i2snum].regptr);

      /* enable the I2S Channel pin muxing */
      i2s_pin_mux(i2snum, 1);

      /* Empty ring buffer and set conversion counter to 0 */
      i2sdat[i2snum].rx_head = i2sdat[i2snum].rx_tail = 0;

      /* Return pointer to I2S configuration structure */
      status = (INT_32) & i2sdat[i2snum];
    }
  }

  return status;

}

/***********************************************************************
 *
 * Function: i2s_close
 *
 * Purpose: Close the I2S
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR to the caller as the
 *     device was not previously opened. Otherwise, disable the I2S
 *     interface and controller and return
 *     _NO_ERROR to the caller.
 *
 * Parameters:
 *     devid: Pointer to I2S config structure
 *
 * Outputs: None
 *
 * Returns: The status of the close operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS i2s_close(INT_32 devid)
{
  I2S_CFG_T *pi2s = (I2S_CFG_T *) devid;
  STATUS status = _ERROR;
  UNS_32 tmp;

  /* Close and disable device if it was previously initialized */
  if (pi2s->init == TRUE)
  {
    /* Place I2S in a default state */
    pi2s->regptr->i2s_dao = I2S_MUTE | I2S_STOP | I2S_RESET;
    pi2s->regptr->i2s_dai = I2S_STOP | I2S_RESET;

    /* reset Tx rate to default */
    pi2s->regptr->i2s_tx_rate = 0;

    /* reset Rx rate to default */
    pi2s->regptr->i2s_rx_rate = 0;

    /* clear the DMA */
    pi2s->regptr->i2s_dma0 = 0;

    /* clear the DMA */
    pi2s->regptr->i2s_dma1 = 0;

    /* Disable interrupts */
    pi2s->regptr->i2s_irq = 0;

