sobczyk/bsp/csps/lpc32xx/source/lpc32xx_i2s_driver.c
    /* Free I2S and Disable clock */
    pi2s->init = FALSE;

    if (pi2s->i2snum == 0)
    {
      clkpwr_clk_en_dis(CLKPWR_I2S0_CLK, 0);
    }
    else
    {
      clkpwr_clk_en_dis(CLKPWR_I2S1_CLK, 0);
    }

    /* relaese the pins muxing */
    i2s_pin_mux(pi2s->i2snum, 0);

    /* return the I2S1 DMA to default */
    if (pi2s->i2snum == I2S_CH1)
    {
      tmp = CLKPWR->clkpwr_i2s_clk_ctrl;
      tmp = tmp & ~CLKPWR_I2SCTRL_I2S1_USE_DMA;
      CLKPWR->clkpwr_i2s_clk_ctrl = tmp;
    }
    
    status = _NO_ERROR;       
   
  }

  return status;
}

/***********************************************************************
 *
 * Function: i2s_ioctl
 *
 * Purpose: I2S configuration block
 *
 * Processing:
 *     This function is a large case block. Based on the passed function
 *     and option values, set or get the appropriate I2S parameter.
 *
 * Parameters:
 *     devid: Pointer to I2S config structure
 *     cmd:   ioctl command
 *     arg:   ioctl argument
 *
 * Outputs: None
 *
 * Returns: The status of the ioctl operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS i2s_ioctl(INT_32 devid,
                 INT_32 cmd,
                 INT_32 arg)
{
  I2S_REGS_T *i2sregsptr;
  I2S_CFG_T *i2scfgptr = (I2S_CFG_T *) devid;
  STATUS status = _ERROR;

  if (i2scfgptr->init == TRUE)
  {
    status = _NO_ERROR;
    i2sregsptr = i2scfgptr->regptr;

    switch (cmd)
    {
      /* setup I2S chennal with default parameters */  
      case I2S_SETUP_PARAMS:
        i2s_set_ctrl_params((I2S_REGS_T *)i2sregsptr, 
                            (I2S_PRMS_T *) arg);
        break;

      case I2S_DO_MUTE:
        if (arg != 0)
        {
          /* Mute the transmit channel */
          i2sregsptr->i2s_dao |= I2S_MUTE;
        }
        else
        {
          /* Disable transmit channel mute */
          i2sregsptr->i2s_dao &= ~I2S_MUTE;
        }
        break;

      case I2S_DO_RESET:
        if (arg != 0)
        {
          /* Reset the transmit channel */
          i2sregsptr->i2s_dao |= I2S_RESET;
        }
        else
        {
          /* Clear the transmit channel reset */
          i2sregsptr->i2s_dao &= ~I2S_RESET;
        }
        break;

      case I2S_DI_RESET:
        if (arg != 0)
        {
          /* Reset the receive channel */
          i2sregsptr->i2s_dai |= I2S_RESET;
        }
        else
        {
          /* Clear the receive channel reset  */
          i2sregsptr->i2s_dai &= ~I2S_RESET;
        }
        break;

      case I2S_DO_STOP:
        if (arg != 0)
        {
          /* Stop the transmit channel FIFO filling */
          i2sregsptr->i2s_dao |= I2S_STOP;
        }
        else
        {
          /* Allow the transmit channel FIFO to fill*/
          i2sregsptr->i2s_dao &= ~I2S_STOP;
        }
        break;

      case I2S_DI_STOP:
        if (arg != 0)
        {
          /* STOP filling the receive channel FIFO*/
          i2sregsptr->i2s_dai |= I2S_STOP;
        }
        else
        {
          /* Allow the receive channel FIFO to fill */
          i2sregsptr->i2s_dai &= ~I2S_STOP;
        }
        break;

      case I2S_TX_RATE:
        if (arg != 0)
        {
          /* Set the I2S Tx rate */
          i2sregsptr->i2s_tx_rate = arg;
        }
        break;

      case I2S_RX_RATE:
        if (arg != 0)
        {
          /* Set the I2S Rx rate */
          i2sregsptr->i2s_rx_rate = arg;
        }
        break;

      case I2Sx_RX_IRQ_EN:
        if (arg != 0)
        {
          /* I2S Rx Interrupt Enable */
          i2sregsptr->i2s_irq |= I2S_RX_IRQ_EN;
        }
        else
        {
          /* I2S Rx Interrupt Disable */
          i2sregsptr->i2s_irq &= ~I2S_RX_IRQ_EN;
        }

        break;

      case I2Sx_TX_IRQ_EN:

        if (arg != 0)
        {
          /* I2S Rx Interrupt Enable */
          i2sregsptr->i2s_irq |= I2S_TX_IRQ_EN;
        }
        else
        {
          /* I2S Rx Interrupt Disable */
          i2sregsptr->i2s_irq &= ~I2S_TX_IRQ_EN;
        }
        break;

      case I2Sx_DMA0_TX_EN:

        if (arg != 0)
        {
          /* I2S Tx DMA Enable */
          i2sregsptr->i2s_dma0 |= I2S_DMA0_TX_EN;
        }
        else
        {
          /* I2S Tx DMA Disable */
          i2sregsptr->i2s_dma0 &= ~I2S_DMA0_TX_EN;
        }
        break;

      case I2Sx_DMA0_RX_EN:

        if (arg != 0)
        {
          /* I2S Rx DMA Enable */
          i2sregsptr->i2s_dma0 |= I2S_DMA0_RX_EN;
        }
        else
        {
          /* I2S Rx DMA Disable */
          i2sregsptr->i2s_dma0 &= ~I2S_DMA0_RX_EN;
        }
        break;

      case I2Sx_DMA1_TX_EN:

        if (arg != 0)
        {
          /* I2S Tx DMA Enable */
          i2sregsptr->i2s_dma1 |= I2S_DMA1_TX_EN;
        }
        else
        {
          /* I2S Tx DMA Disable */
          i2sregsptr->i2s_dma1 &= ~I2S_DMA1_TX_EN;
        }
        break;

      case I2Sx_DMA1_RX_EN:

        if (arg != 0)
        {
          /* I2S Rx DMA Enable */
          i2sregsptr->i2s_dma1 |= I2S_DMA1_RX_EN;
        }
        else
        {
          /* I2S Rx DMA Disable */
          i2sregsptr->i2s_dma1 &= ~I2S_DMA1_RX_EN;
        }
        break;

      default:
        /* Unsupported parameter */
        status = LPC_BAD_PARAMS;
        break;
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: i2s_read_result
 *
 * Purpose: I2S read function (stub only)
 *
 * Processing:
 *     Returns 0 to the caller.
 *
 * Parameters:
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually read (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 i2s_read_result(INT_32 devid,
                       void *buffer)
{
  INT_32  bytes;
  bytes = 0;

