sobczyk/bsp/csps/lpc32xx/source/lpc32xx_i2s_driver.c
  return bytes;
}


/***********************************************************************
 *
 * Function: i2s_write
 *
 * Purpose: I2S write function (stub only)
 *
 * Processing:
 *     Returns 0 to the caller.
 *
 * Parameters:
 *     devid: Pointer to I2S config structure
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of bytes to write
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually written (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 i2s_write(INT_32 devid,
                 void *buffer,
                 INT_32 n_bytes)
{
  return 0;
}

/***********************************************************************
 *
 * Function: i2s_read_ring
 *
 * Purpose: Reads data from the I2S ring buffer
 *
 * Processing:
 *     If the init flag for the I2S structure is FALSE, return 0 to
 *     the caller. Otherwise, save the state of the I2S interrupts and
 *     disable the I2S interrupts. Loop until max_bytes equals 0 or
 *     until the receive ring buffer is empty, whichever comes
 *     first. Read the data from the ring buffer  indexed by the tail
 *     pointer and place it into the user buffer. Increment the tail
 *     pointer and user buffer pointer. If the tail pointer exceeds the
 *     buffer size, set the tail pointer to 0. Increment bytes, and
 *     decrement max_bytes. Exit the loop based on the loop conditions,
 *     re-enable the receive interrupts, and return the number of bytes
 *     read to the caller.
 *     Depending on the I2S Word Width, the function will read 8/16 or
 *     32bits of data at a time into the ring buffer and increment
 *     as appropriate
 *
 * Parameters:
 *     devid:     Pointer to an I2S configuration structure
 *     buffer:    Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 *
 * Outputs: None
 *
 * Returns: The number of bytes actually read from the ring buffer
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 i2s_read_ring(INT_32 devid,
                     void *buffer,
                     INT_32 max_bytes)
{

  I2S_CFG_T *i2scfgptr = (I2S_CFG_T *) devid;
  INT_32 bytes = 0;

  UNS_32 *data = (UNS_32 *) buffer;

  if (i2scfgptr->init == TRUE)
  {
    /* Temporarily lock out I2S interrupts during this
       read so the I2S receive interrupt won't cause problems
       with the ring buffer index values */
    if (i2scfgptr->i2snum == I2S_CH0)
    {
      int_disable(IRQ_I2S0);
    }
    else if (i2scfgptr->i2snum == I2S_CH1)
    {
      int_disable(IRQ_I2S1);
    }

    /* Loop until receive ring buffer is empty or until max_bytes
       expires */
    while ((max_bytes > 0) &&
           (i2scfgptr->rx_tail != i2scfgptr->rx_head))
    {
      /* Read data from ring buffer into user buffer */
      *data = i2scfgptr->rx[i2scfgptr->rx_tail];
      data++;

      /* Update tail pointer */
      i2scfgptr->rx_tail++;

      /* Make sure tail didn't overflow */
      if (i2scfgptr->rx_tail >= I2S_RING_BUFSIZE)
      {
        i2scfgptr->rx_tail = 0;
      }

      /* Increment data count and decrement buffer size count */
      bytes = bytes + 4;
      max_bytes = max_bytes - 4;
    }

    /* Re-enable I2S receive interrupt(s) */
    if (i2scfgptr->i2snum == 0)
    {
      int_enable(IRQ_I2S0);
    }
    else if (i2scfgptr->i2snum == 1)
    {
      int_enable(IRQ_I2S1);
    }

  }

  return bytes;

}
/***********************************************************************
 *
 * Function: i2s_ring_fill
 *
 * Purpose: Move data from the I2S DAT to the driver ring buffer
 *
 * Processing:
 *     While there is I2S FIFO data, copy an entry from the I2S FIFO into
 *     the IS2 driver ring buffer. Increment the ring buffer
 *     head pointer. If it exceeds the ring buffer size, reset the
 *     head pointer to 0.
 *
 * Parameters:
 *     i2scfgptr: Pointer to I2S config structure
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
STATIC void i2s_ring_fill(I2S_CFG_T *i2scfgptr)
{
  I2S_REGS_T *i2sregsptr = i2scfgptr->regptr;

  /* Read from Rx FIFO until empty */
  while ((i2sregsptr->i2s_stat & I2S_RX_STATE_MASK) != 0)
  {
    i2scfgptr->rx[i2scfgptr->rx_head] = i2sregsptr->i2s_rx_fifo;

    /* Increment receive ring buffer head pointer */
    i2scfgptr->rx_head++;
    if (i2scfgptr->rx_head >= I2S_RING_BUFSIZE)
    {
      i2scfgptr->rx_head = 0;
    }
  }
}
/***********************************************************************
 *
 * Function: i2s0_interrupt
 *
 * Purpose: I2S0 interrupt handler
 *
 * Processing:
 *     On an interrupt call the i2s_ring_fill() to move
 *     the data from the I2S
 *     FIFO to the I2S driver ring buffer.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/

void i2s0_interrupt(void)
{
  /* read the I2S result into a buffer */
  i2s_ring_fill(&i2sdat[I2S_CH0]);
}
/***********************************************************************
 *
 * Function: i2s1_interrupt
 *
 * Purpose: I2S1 interrupt handler
 *
 * Processing:
 *     On an interrupt call the i2s_ring_fill() to move
 *     the data from the I2S
 *     FIFO to the I2S driver ring buffer.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/

void i2s1_interrupt(void)
{
  /* read the I2S1 result into a buffer */
  i2s_ring_fill(&i2sdat[I2S_CH1]);
}

